# Data Input Output

In [1]:
import pandas as pd

In [2]:
pwd

'E:\\Machine-Learning-Projects\\Code-Files\\Python-Libraries'

In [3]:
df = pd.read_csv('Excel_Sample.csv')

In [4]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [5]:
df.to_csv('Output',index=False)

In [6]:
pd.read_csv('Output')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [7]:
df = pd.read_excel('Excel_Sample.xlsx')

In [8]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [13]:
df.columns

Index(['Unnamed: 0', 'a', 'b', 'c', 'd'], dtype='object')

In [15]:
df.drop(columns='Unnamed: 0',inplace=True,axis=1)

In [16]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [18]:
#df.to_excel('Sample2.xlsx', sheet_name='Sheet1')

In [19]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [21]:
type(df)

list

In [22]:
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"